# Merging joining and concatination

In [18]:
import numpy as np
import pandas as pd

Merging 2 dataframes

In [19]:
employees = pd.DataFrame({
    'employee_id': [1,2,3,4,5],
    'name': ['jhon', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})

In [20]:
salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60000, 80000, 65000, 70000, 90000],
    'bonus': [5000, 10000, 7000, 8000, 12000]
})

In [21]:
employees

   employee_id   name department
0            1   jhon         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [22]:
salaries

   employee_id  salary  bonus
0            1   60000   5000
1            2   80000  10000
2            3   65000   7000
3            6   70000   8000
4            7   90000  12000

In [25]:
pd.merge(employees, salaries) # this will give an inner join by default
# we can also specify on which column to join
pd.merge(employees, salaries, on='employee_id')

   employee_id   name department  salary  bonus
0            1   jhon         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [28]:
pd.merge(employees, salaries, how='outer', on='employee_id') # outer join

   employee_id   name department   salary    bonus
0            1   jhon         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN
5            6    NaN        NaN  70000.0   8000.0
6            7    NaN        NaN  90000.0  12000.0

In [29]:
pd.merge(employees, salaries, how='left', on='employee_id') # left join

   employee_id   name department   salary    bonus
0            1   jhon         HR  60000.0   5000.0
1            2   Anna         IT  80000.0  10000.0
2            3  Peter    Finance  65000.0   7000.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN

In [30]:
pd.merge(employees, salaries, how='right', on='employee_id') # right join

   employee_id   name department  salary  bonus
0            1   jhon         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000
3            6    NaN        NaN   70000   8000
4            7    NaN        NaN   90000  12000

concatination

In [31]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})

In [32]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [33]:
df2

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [34]:
pd.concat([df1, df2]) # default axis is 0, i.e. row-wise concatenation

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [35]:
pd.concat([df1, df2], axis=1) # column-wise concatenation

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

Joining

In [36]:
df1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

# Second DataFrame
df2 = pd.DataFrame({
    'score': [85, 90, 95]
}, index=[2, 3, 4])

In [37]:
df1

      name
1    Alice
2      Bob
3  Charlie

In [38]:
df2

   score
2     85
3     90
4     95

In [39]:
df1.join(df2) # joins on index by default

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0

In [41]:
df1.join(df2, how='outer') # outer join

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   95.0

In [42]:
df2.join(df1, how='outer') # outer join

   score     name
1    NaN    Alice
2   85.0      Bob
3   90.0  Charlie
4   95.0      NaN